app/views/leaflets/show.html.haml

SELECT  "activities".* FROM "activities"  WHERE "activities"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
%p Zapisani
-activity1 = Activity.find(1)
-user = User.find(activity1.user_id)