app/views/leaflets/show.html.erb

<p>Zapisani</p>
<% activity1 = Activity.find(1) %>
<% user = User.find(activity1.user_id) %>
---
SELECT  "activities".* FROM "activities"  WHERE "activities"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]