app/views/shared/_signed.html.haml


        -user = User.find_by(id: signed.user_id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1