app/controllers/leaflets_controller.rb

SELECT "leaflets".* FROM "leaflets"  GROUP BY date  ORDER BY "leaflets"."date" ASC
---
  def index
  	# ordered from earliest to latest date
  	@leaflets = Leaflet.order(:date)

SELECT  "leaflets".* FROM "leaflets"  WHERE "leaflets"."id" = ? LIMIT 1  [["id", 3]]
SELECT "activities".* FROM "activities"  WHERE "activities"."activity_type" = 'leaflets' AND "activities"."activity_id" = 14
---
  def show
  	@leaflets = Leaflet.find(params[:id])

#    get users signed up for this activity
    @signed = Activity.where(activity_type: "leaflets", activity_id: params[:id])