app/controllers/lectures_controller.rb

  def index
  	# order by earliest to latest lecture time
  	@lectures = Lecture.order(:time)

  	# find and group lectures by days of the week
    # regexes match all variations of weekday names in Polish,
    #   only first two letters are needed to distinct days (it's not case sensitive)

    @mondays = Lecture.where("day LIKE ?", "po%")
---
SELECT "lectures".* FROM "lectures"   ORDER BY "lectures"."time" ASC, time DESC
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."day" = 'poniedziałek'  ORDER BY "lectures"."id" ASC LIMIT 1

  def show
  	@lectures = Lecture.find(params[:id])
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 5]]