app/controllers/lectures_controller.rb

SELECT "lectures".* FROM "lectures"   ORDER BY "lectures"."day" ASC
---
  def index
  	# ordered from earliest to latest date
  	@lectures = Lecture.order(:day)