app/controllers/lectures_controller.rb

  def index
  	# find and group lectures by days of the week
    # regexes match all variations of weekday names in Polish,
    #   only first two letters are needed to distinct days (it's not case sensitive)

    @mondays = Lecture.order(:hour).where("day LIKE ?", "po%")
---
SELECT  "lectures".* FROM "lectures"  WHERE (day LIKE 'po%')  ORDER BY "lectures"."hour" ASC LIMIT 1