app/controllers/others_controller.rb

  def index
  	# ordered from earliest to latest date
  	@others = Other.order(:date)
---
SELECT "others".* FROM "others"   ORDER BY "others"."date" ASC

  def show
  	@others = Other.find(params[:id])

    #    get users signed up for this activity
    @signed = Activity.where(activity_type: params[:controller], activity_id: params[:id])

     # find if current user is signed up for this activity
    @signed_user = Activity.where(activity_type: params[:controller], activity_id: params[:id], user_id: current_user.id)
---
SELECT  "others".* FROM "others"  WHERE "others"."id" = ? LIMIT 1  [["id", 5]]
SELECT "activities".* FROM "activities"  WHERE "activities"."activity_type" = 'others' AND "activities"."activity_id" = 1
SELECT  "activities".* FROM "activities"  WHERE "activities"."activity_type" = 'others' AND "activities"."activity_id" = 1 AND "activities"."user_id" = 2 LIMIT 1