app/controllers/posters_controller.rb

SELECT "posters".* FROM "posters"   ORDER BY "posters"."date" ASC
---
  def index
  	# ordered from earliest to latest date
  	@posters = Poster.order(:date)

SELECT  "posters".* FROM "posters"  WHERE "posters"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	@posters = Poster.find(params[:id])