app/controllers/posters_controller.rb

  def index
  	@posters = Poster.all
---
SELECT "posters".* FROM "posters"