app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1
---
  def show
  	@users = User.find(params[:id])